In [1]:
import pandas as pd

import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [2]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],

})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [3]:
df3=pd.merge(df1,df2, on='city') 
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [4]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [5]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [6]:
df3=pd.merge(df1,df2)
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [7]:
# it include only the intersection
df4=pd.merge(df1,df2,how="inner")
df4

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [8]:
# it contain the unioun 
df5=pd.merge(df1,df2,how="outer")
df5

        city  temperature  humidity
0   new york         21.0      68.0
1    chicago         14.0      65.0
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
4  san diego          NaN      71.0